# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py

import os
import easy

todo = input(' 1. Перейти в папку \n 2. Просмотреть содержимое текущей папки \n 3. Удалить папку \n 4. Создать папку \n 0. Выйти \n Выбрать действие: ')
while todo!='0':
    if todo == '1':
        try:
            os.chdir(input(f'dir: {os.getcwd()}  cd:'))
        except OSError:
            print('something wrong')
        print(f'dir: {os.getcwd()}')
    elif todo == '2':
        print( easy.alldirs())
    elif todo == '3':
        easy.makedirs()
    elif todo == '4':
        easy.deldirs()
    todo = input('\n 1. Перейти в папку \n 2. Просмотреть содержимое текущей папки \n 3. Удалить папку \n 4. Создать папку \n 0. Выйти \n Выбрать действие: ')